Tekla Open API Reference for Tekla Structures 2025
CrossSectionPoint Methods
The CrossSectionPoint type exposes the following members.
Methods
Name | Description
CompareTo
 Compares two points. To use binarysearch somekind of sorting should be used.
 (Inherited from Point.)
Equals
 Returns true if the current object and the given object are equal.
 (Inherited from Point.)
GetHashCode
 Returns a hash code for the point. Notice, in extremely rare cases, you might not get the same hash code for two points even though they are considered equal! This should, however, happen only in extremely rare cases!
 (Inherited from Point.)
ToString
 Formats the point into a string.
 (Inherited from Point.)
Translate
 Translates the point using the given vector.
 (Inherited from Point.)
Zero
 Zeros all the members of the point.
 (Inherited from Point.)
Top
See Also
Reference
CrossSectionPoint Class
Tekla.Structures.Catalogs Namespace